amore55/m5Dash/sdkconfig.defaults
# ---------------------------------------------------------------------------------------
# HTTP client / server
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_INSECURE=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# ---------------------------------------------------------------------------------------
# lwIP / SNTP
# ---------------------------------------------------------------------------------------
CONFIG_LWIP_LOCAL_HOSTNAME="desk-dashboard"
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_DHCP_GET_NTP_SRV=n
CONFIG_LWIP_SO_RCVBUF=y

# ---------------------------------------------------------------------------------------
# Wi-Fi via the ESP32-C6 coprocessor (esp_wifi_remote over esp_hosted / SDIO).
#
# THESE PINS ARE THE TAB5's — copied from M5Stack's own committed sdkconfig for this board.
# Do not "tidy" them. See docs/IMPLEMENTATION_PLAN.md §5.
#
# bsp_feature_enable(BSP_FEATURE_WIFI, true) must be called before esp_wifi_init(); the
# board's second IO expander gates power to the C6. tab5_board::Board::enableWifiRail()
# does this.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
# D1 IS SPECIAL AND MUST BE SET VIA THE _PRIV_ SYMBOL.
#
# ESP_HOSTED_SDIO_PIN_D1 is declared in esp_hosted's Kconfig as a bare `int` with NO prompt —
# it is a derived symbol whose value comes from ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS (or the
# 1-bit equivalent). Setting CONFIG_ESP_HOSTED_SDIO_PIN_D1 here is therefore SILENTLY IGNORED,
# and D1 falls back to its ESP32-P4 default of 15 — which is also the slave reset pin.
#
# The result is a pin collision that presents as an SDIO enumeration failure and an abort inside
# hosted_sdio_card_fn_init(), i.e. a boot loop:
#
#   sdio_wrapper: GPIOs: CLK[12] CMD[13] D0[11] D1[15] D2[9] D3[8] Slave_Reset[15]
#   sdmmc_io: sdmmc_io_rw_extended: sdmmc_send_cmd returned 0xffffffff
#   sdio_wrapper: failed to get CIS data.
#
# Both keys are set: the _PRIV_ one because it is what actually takes effect, and the derived
# one for documentation and so a diff against M5Stack's configuration matches.
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ---------------------------------------------------------------------------------------
# Screen rotation via the ESP32-P4's Pixel Processing Accelerator.
#
# The panel is physically 720x1280 portrait; the UI is 1280x720 landscape. Without this,
# esp_lvgl_port rotates every flushed area on the CPU with lv_draw_sw_rotate(), which on a
# 921,600-pixel display is a lot of work to do in software when the SoC has dedicated
# hardware for exactly this.
#
# It also allocates its buffer with heap_caps_aligned_calloc() at the cache line size
# (lcd_ppa.c:59), whereas the software path uses a plain heap_caps_malloc() — which matters
# because the buffers live in PSRAM and are cache-synced.
#
# Requires SOC_PPA_SUPPORTED, which is 1 on the ESP32-P4. Defaults to n upstream.
# ---------------------------------------------------------------------------------------
# TEMPORARILY OFF while the display is being brought up: Espressif's reference config for this
# board does not enable it, and the goal right now is to match a known-good configuration
# exactly. Re-enable once a picture is confirmed — it is genuinely worth having, since it moves
# rotation off the CPU onto dedicated hardware.
CONFIG_LVGL_PORT_ENABLE_PPA=n

# ---------------------------------------------------------------------------------------
# M5Stack Tab5 BSP
#
# NOTE: tab5_board::Board::init() passes an explicit bsp_display_cfg_t and therefore does not
# use CONFIG_BSP_LCD_DRAW_BUF_HEIGHT. It is kept in step with the value in board.cpp so the
# two do not tell different stories.
#
# Draw buffers are 720 x 120 px x 2 B = 173 KB each, in DMA-capable PSRAM (not internal RAM).
# See the long comment in board.cpp: rotation needs a third buffer of the same size, and
# three of these do not fit in the ~243 KB largest internal block.
# ---------------------------------------------------------------------------------------
CONFIG_BSP_ERROR_CHECK=y
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=40
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1
CONFIG_BSP_LCD_USE_DMA2D=y
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=n
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

# ---------------------------------------------------------------------------------------
# LVGL 9
#
# CLIB malloc/string/sprintf: PSRAM-backed heap via the IDF allocator instead of LVGL's
# own fixed pool, so a large label or a task list cannot exhaust a private arena.
# Only the font sizes the theme actually uses are enabled, to keep the binary small.
# ---------------------------------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_16=y
# Custom malloc: LVGL allocates from PSRAM via components/dashboard_core/src/lvgl_heap.c.
# NOT CLIB malloc — SPIRAM_MALLOC_ALWAYSINTERNAL=16384 puts every sub-16KB malloc in
# internal SRAM, which measured at 47.5 KB of internal RAM for six resident pages.
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=25
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=n
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_ARC=y

# ---------------------------------------------------------------------------------------
# LittleFS (tasks + API response cache)
# ---------------------------------------------------------------------------------------
CONFIG_LITTLEFS_MAX_PARTITIONS=1
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_FCNTL_GET_PATH=n

# ---------------------------------------------------------------------------------------
# Logging. INFO by default; the network and secret-bearing modules downgrade their own
# verbose output at compile time (see dashboard/log.hpp).
# ---------------------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
